In [278]:
#INSTANTIATE PANDAS
import pandas as pd
#INITIALIZE COLUMNS:
col1 = [1,2,2,2,1,None,2,None,None,None,None,None,None,None,8,9,10]
col2 = [10,21,22,22,None,None,2,None,None,None,None,None,None,None,81,92,102]
col3 = ["log","text","log","log",None,None,2,None,None,"text","text","log","log","csv","csv","csv","log"]
col4 = ["blue","green","red","red","blue","blue","blue","green",None,None,"blue","red","red","red","red","red","red"]
col5 = [10,21,22,22,None,None,2,None,None,None,None,None,None,None,81,92,102]

In [279]:
# CREATE DATAFRAME WITH THESE COLUMNS
df = pd.DataFrame({"first": col1, "second": col2, "third": col3, "fourth": col4, "fifth": col5})
df

    first  second third fourth  fifth
0     1.0    10.0   log   blue   10.0
1     2.0    21.0  text  green   21.0
2     2.0    22.0   log    red   22.0
3     2.0    22.0   log    red   22.0
4     1.0     NaN  None   blue    NaN
5     NaN     NaN  None   blue    NaN
6     2.0     2.0     2   blue    2.0
7     NaN     NaN  None  green    NaN
8     NaN     NaN  None   None    NaN
9     NaN     NaN  text   None    NaN
10    NaN     NaN  text   blue    NaN
11    NaN     NaN   log    red    NaN
12    NaN     NaN   log    red    NaN
13    NaN     NaN   csv    red    NaN
14    8.0    81.0   csv    red   81.0
15    9.0    92.0   csv    red   92.0
16   10.0   102.0   log    red  102.0

In [280]:
# GET THE NUMBER OF ROWS
df.shape[0]

17

In [281]:
# GET THE NUMBER OF COLUMNS
df.shape[1]

5

In [282]:
# SHOW FIRST 5 ROWS AND COLUMNS
df.iloc[0:5,0:5]

   first  second third fourth  fifth
0    1.0    10.0   log   blue   10.0
1    2.0    21.0  text  green   21.0
2    2.0    22.0   log    red   22.0
3    2.0    22.0   log    red   22.0
4    1.0     NaN  None   blue    NaN

In [283]:
# CREATE A NEW COLUMN
df["sixth"] = df["second"]*df["fifth"]
df.iloc[0:16,0:6]

    first  second third fourth  fifth   sixth
0     1.0    10.0   log   blue   10.0   100.0
1     2.0    21.0  text  green   21.0   441.0
2     2.0    22.0   log    red   22.0   484.0
3     2.0    22.0   log    red   22.0   484.0
4     1.0     NaN  None   blue    NaN     NaN
5     NaN     NaN  None   blue    NaN     NaN
6     2.0     2.0     2   blue    2.0     4.0
7     NaN     NaN  None  green    NaN     NaN
8     NaN     NaN  None   None    NaN     NaN
9     NaN     NaN  text   None    NaN     NaN
10    NaN     NaN  text   blue    NaN     NaN
11    NaN     NaN   log    red    NaN     NaN
12    NaN     NaN   log    red    NaN     NaN
13    NaN     NaN   csv    red    NaN     NaN
14    8.0    81.0   csv    red   81.0  6561.0
15    9.0    92.0   csv    red   92.0  8464.0

In [284]:
# FILL COL 1 FORWARD
df["first"] = df["first"].ffill()

# FILL COL 6 BACKWARD
df["sixth"] = df["sixth"].bfill()
df

    first  second third fourth  fifth    sixth
0     1.0    10.0   log   blue   10.0    100.0
1     2.0    21.0  text  green   21.0    441.0
2     2.0    22.0   log    red   22.0    484.0
3     2.0    22.0   log    red   22.0    484.0
4     1.0     NaN  None   blue    NaN      4.0
5     1.0     NaN  None   blue    NaN      4.0
6     2.0     2.0     2   blue    2.0      4.0
7     2.0     NaN  None  green    NaN   6561.0
8     2.0     NaN  None   None    NaN   6561.0
9     2.0     NaN  text   None    NaN   6561.0
10    2.0     NaN  text   blue    NaN   6561.0
11    2.0     NaN   log    red    NaN   6561.0
12    2.0     NaN   log    red    NaN   6561.0
13    2.0     NaN   csv    red    NaN   6561.0
14    8.0    81.0   csv    red   81.0   6561.0
15    9.0    92.0   csv    red   92.0   8464.0
16   10.0   102.0   log    red  102.0  10404.0

In [285]:
# ITERATE OVER SERIES AND DO SIMPLE REPLACEMENT
# PUSH THE NEW VALUES BACK INTO THE SERIES
new_vals = []
for i,t in df["second"].iteritems():
    if t == 2.0:
        t = 90.00
    new_vals.append(t)

df["second"] = new_vals
df

    first  second third fourth  fifth    sixth
0     1.0    10.0   log   blue   10.0    100.0
1     2.0    21.0  text  green   21.0    441.0
2     2.0    22.0   log    red   22.0    484.0
3     2.0    22.0   log    red   22.0    484.0
4     1.0     NaN  None   blue    NaN      4.0
5     1.0     NaN  None   blue    NaN      4.0
6     2.0    90.0     2   blue    2.0      4.0
7     2.0     NaN  None  green    NaN   6561.0
8     2.0     NaN  None   None    NaN   6561.0
9     2.0     NaN  text   None    NaN   6561.0
10    2.0     NaN  text   blue    NaN   6561.0
11    2.0     NaN   log    red    NaN   6561.0
12    2.0     NaN   log    red    NaN   6561.0
13    2.0     NaN   csv    red    NaN   6561.0
14    8.0    81.0   csv    red   81.0   6561.0
15    9.0    92.0   csv    red   92.0   8464.0
16   10.0   102.0   log    red  102.0  10404.0

In [286]:
# REMOVE TOP TWO ROWS
df = df[2:]

# RESET THE INDEX
# drop=True ensures that the index is updated only and not added as a column.
df = df.reset_index(drop=True)
df

    first  second third fourth  fifth    sixth
0     2.0    22.0   log    red   22.0    484.0
1     2.0    22.0   log    red   22.0    484.0
2     1.0     NaN  None   blue    NaN      4.0
3     1.0     NaN  None   blue    NaN      4.0
4     2.0    90.0     2   blue    2.0      4.0
5     2.0     NaN  None  green    NaN   6561.0
6     2.0     NaN  None   None    NaN   6561.0
7     2.0     NaN  text   None    NaN   6561.0
8     2.0     NaN  text   blue    NaN   6561.0
9     2.0     NaN   log    red    NaN   6561.0
10    2.0     NaN   log    red    NaN   6561.0
11    2.0     NaN   csv    red    NaN   6561.0
12    8.0    81.0   csv    red   81.0   6561.0
13    9.0    92.0   csv    red   92.0   8464.0
14   10.0   102.0   log    red  102.0  10404.0

In [287]:
# REMOVE THE BOTTOM TWO ROWS
df = df[:-2]

# RESET THE INDEX AGAIN
df = df.reset_index(drop=True)
df

    first  second third fourth  fifth   sixth
0     2.0    22.0   log    red   22.0   484.0
1     2.0    22.0   log    red   22.0   484.0
2     1.0     NaN  None   blue    NaN     4.0
3     1.0     NaN  None   blue    NaN     4.0
4     2.0    90.0     2   blue    2.0     4.0
5     2.0     NaN  None  green    NaN  6561.0
6     2.0     NaN  None   None    NaN  6561.0
7     2.0     NaN  text   None    NaN  6561.0
8     2.0     NaN  text   blue    NaN  6561.0
9     2.0     NaN   log    red    NaN  6561.0
10    2.0     NaN   log    red    NaN  6561.0
11    2.0     NaN   csv    red    NaN  6561.0
12    8.0    81.0   csv    red   81.0  6561.0

In [288]:
# GRAB A SHORT SUBSET
df_subset_raw = df.iloc[0:4,0:6]
df_subset_raw

   first  second third fourth  fifth  sixth
0    2.0    22.0   log    red   22.0  484.0
1    2.0    22.0   log    red   22.0  484.0
2    1.0     NaN  None   blue    NaN    4.0
3    1.0     NaN  None   blue    NaN    4.0

In [289]:
# MELT THE THIRD AND FOURTH COLUMNS INTO ROWS
# KEEP THE FIRST, SECOND, FIFTH and SIXTH COLUMNS STATIC AND MELT THE DATA AROUND THEM
# USE NAME: "ATTRIBUTE" FOR THE NEW COLUMN NAME and "VALUES" FOR NEW COLUMN VALUES
static = [ "first", "second", "fifth", "sixth" ]
df_subset_raw.melt(id_vars=static, var_name='attribute', value_name='values')

   first  second  fifth  sixth attribute values
0    2.0    22.0   22.0  484.0     third    log
1    2.0    22.0   22.0  484.0     third    log
2    1.0     NaN    NaN    4.0     third   None
3    1.0     NaN    NaN    4.0     third   None
4    2.0    22.0   22.0  484.0    fourth    red
5    2.0    22.0   22.0  484.0    fourth    red
6    1.0     NaN    NaN    4.0    fourth   blue
7    1.0     NaN    NaN    4.0    fourth   blue

In [290]:
#RE ORGANISE THE COLUMNS. MOVE ATTRIBUTE AND VALUE TO THE BEGINNING
new_column_order = ["attribute", "values", "first", "second", "fifth", "sixth"]
df = df.reindex(columns=new_column_order)
df

    attribute  values  first  second  fifth   sixth
0         NaN     NaN    2.0    22.0   22.0   484.0
1         NaN     NaN    2.0    22.0   22.0   484.0
2         NaN     NaN    1.0     NaN    NaN     4.0
3         NaN     NaN    1.0     NaN    NaN     4.0
4         NaN     NaN    2.0    90.0    2.0     4.0
5         NaN     NaN    2.0     NaN    NaN  6561.0
6         NaN     NaN    2.0     NaN    NaN  6561.0
7         NaN     NaN    2.0     NaN    NaN  6561.0
8         NaN     NaN    2.0     NaN    NaN  6561.0
9         NaN     NaN    2.0     NaN    NaN  6561.0
10        NaN     NaN    2.0     NaN    NaN  6561.0
11        NaN     NaN    2.0     NaN    NaN  6561.0
12        NaN     NaN    8.0    81.0   81.0  6561.0

In [291]:
# ADD SOME TEXT COLUMNS
seventh = ["lone-wolf", "top-gun", "red-dead","Silverdollar","green-beret","mike-hammer","yellow-jello-belly-smelly","purple-heart","black-knight","white-ghost","grey-beard", "flat-white","michael-angelo"]

# Now work out the index of the next available column
next_col = df.shape[1] # This returns the column numbers from base 0 so can be used for insertion point:

df.insert(loc=next_col, column="seventh", value=seventh, allow_duplicates=True)
df

    attribute  values  first  second  fifth   sixth                    seventh
0         NaN     NaN    2.0    22.0   22.0   484.0                  lone-wolf
1         NaN     NaN    2.0    22.0   22.0   484.0                    top-gun
2         NaN     NaN    1.0     NaN    NaN     4.0                   red-dead
3         NaN     NaN    1.0     NaN    NaN     4.0               Silverdollar
4         NaN     NaN    2.0    90.0    2.0     4.0                green-beret
5         NaN     NaN    2.0     NaN    NaN  6561.0                mike-hammer
6         NaN     NaN    2.0     NaN    NaN  6561.0  yellow-jello-belly-smelly
7         NaN     NaN    2.0     NaN    NaN  6561.0               purple-heart
8         NaN     NaN    2.0     NaN    NaN  6561.0               black-knight
9         NaN     NaN    2.0     NaN    NaN  6561.0                white-ghost
10        NaN     NaN    2.0     NaN    NaN  6561.0                 grey-beard
11        NaN     NaN    2.0     NaN    NaN  6561.0                 flat-white
12        NaN     NaN    8.0    81.0   81.0  6561.0             michael-angelo

In [292]:
# SPLIT COLUMN SEVEN ON HYPHEN DELIMITER
splits = df["seventh"].str.split("-", -1, expand=True)

for i in splits:
    name = "chunk_" + str(i)
    df[name] = splits[i]

df

,attribute,values,first,second,fifth,sixth,seventh,chunk_0,chunk_1,chunk_2,chunk_3
0,NaN,NaN,2.0,22.0,22.0,484.0,lone-wolf,lone,wolf,None,None
1,NaN,NaN,2.0,22.0,22.0,484.0,top-gun,top,gun,None,None
2,NaN,NaN,1.0,NaN,NaN,4.0,red-dead,red,dead,None,None
3,NaN,NaN,1.0,NaN,NaN,4.0,Silverdollar,Silverdollar,None,None,None
4,NaN,NaN,2.0,90.0,2.0,4.0,green-beret,green,beret,None,None
5,NaN,NaN,2.0,NaN,NaN,6561.0,mike-hammer,mike,hammer,None,None
6,NaN,NaN,2.0,NaN,NaN,6561.0,yellow-jello-belly-smelly,yellow,jello,belly,smelly
7,NaN,NaN,2.0,NaN,NaN,6561.0,purple-heart,purple,heart,None,None
8,NaN,NaN,2.0,NaN,NaN,6561.0,black-knight,black,knight,None,None
9,NaN,NaN,2.0,NaN,NaN,6561.0,white-ghost,white,ghost,None,None
10,NaN,NaN,2.0,NaN,NaN,6561.0,grey-beard,grey,beard,None,None
11,NaN,NaN,2.0,NaN,NaN,6561.0,flat-white,flat,white,None,None
12,NaN,NaN,8.0,81.0,81.0,6561.0,michael-angelo,michael,angelo,None,None